{
  "_class_name": "AutoencoderKLCausal3D",
  "_diffusers_version": "0.4.2",
  "act_fn": "silu",
  "block_out_channels": [
    128,
    256,
    512,
    512
  ],
  "down_block_types": [
    "DownEncoderBlockCausal3D",
    "DownEncoderBlockCausal3D",
    "DownEncoderBlockCausal3D",
    "DownEncoderBlockCausal3D"
  ],
  "in_channels": 3,
  "latent_channels": 16,
  "layers_per_block": 2,
  "norm_num_groups": 32,
  "out_channels": 3,
  "sample_size": 256,
  "sample_tsize": 64,
  "up_block_types": [
    "UpDecoderBlockCausal3D",
    "UpDecoderBlockCausal3D",
    "UpDecoderBlockCausal3D",
    "UpDecoderBlockCausal3D"
  ],
  "scaling_factor": 0.476986,
  "time_compression_ratio": 4,
  "mid_block_add_attention": true,
  "mid_block_causal_attn": true
}
